zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syslib.c
uint16_t Cy_SysLib_GetDevice(void)
{
#if defined (CY_IP_M4CPUSS) && !(defined (SRSS_HT_VARIANT) && (SRSS_HT_VARIANT == 1u))
    return ((SFLASH_FAMILY_ID == 0UL) ? CY_SYSLIB_DEVICE_PSOC6ABLE2 : SFLASH_FAMILY_ID);
#elif defined(CY_IP_M33SYSCPUSS)
    return CPUSS_FAMILYID;
#else
    return 0;
#endif
}

#if  defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
void Cy_Syslib_SetWarmBootEntryPoint(uint32_t *entryPoint, bool enable)
{
    *(uint32_t *)CY_SYSPM_BOOTROM_ENTRYPOINT_ADDR = (uint32_t)entryPoint | (enable ? CY_SYSPM_BOOTROM_DSRAM_DBG_ENABLE_MASK : 0UL) ;
}

bool Cy_SysLib_IsDSRAMWarmBootEntry(void)
{
    return cy_WakeupFromWarmBootStatus;
}

void Cy_SysLib_ClearDSRAMWarmBootEntryStatus(void)
{
    cy_WakeupFromWarmBootStatus = false;
}
#endif


#if defined(CY_IP_MXS22SRSS) || defined(CY_IP_MXS40SSRSS)

#if defined (CY_IP_MXS40SSRSS)
bool Cy_SysLib_DebugSessionActive(SRSS_Type *base)
{
    CY_ASSERT_L2(base);
    return ((bool)(_FLD2VAL(SRSS_PWR_CTL_DEBUG_SESSION, base->PWR_CTL)));
}

void Cy_SysLib_DebugCtiMuxConnect(cy_syslib_debug_cti_t *base, uint32_t inTrig, uint32_t outTrig, uint8_t channel, bool enable)
{
    CY_ASSERT_L2(base);
    CY_ASSERT_L2(inTrig < DEBUG_TRC_CTI_CTIINEN_COUNT);
    CY_ASSERT_L2(outTrig < DEBUG_TRC_CTI_CTIOUTEN_COUNT);
    CY_ASSERT_L2(channel < DEBUG_TRC_CTI_TR_CHANNEL_COUNT);

    cy_syslib_debug_cti_t *cti_obj = (cy_syslib_debug_cti_t *) GET_NSALIAS_ADDRESS(base);

    /* Enable CTI */
    cti_obj->CTICONTROL = 0x1U;

    if (enable)
    {
        /* Enable the CTI connection for the selected channel */
        cti_obj->CTIINEN[inTrig] |= (1UL << channel);
        cti_obj->CTIOUTEN[outTrig] |= (1UL << channel);
    }
    else
    {
        /* Disable the CTI connection for the selected channel */
        cti_obj->CTIINEN[inTrig] &= ~(1UL << channel);
        cti_obj->CTIOUTEN[outTrig] &= ~(1UL << channel);
    }
}
#endif /* defined (CY_IP_MXS40SSRSS) */

cy_en_syslib_lcs_mode_t Cy_SysLib_GetDeviceLCS(cy_syslib_lcs_data_t *base)
{
    CY_ASSERT_L2(base);

    cy_en_syslib_lcs_mode_t lcsMode;

#if defined(CY_IP_MXS40SSRSS)
    uint32_t temp = base->BOOTROW & (0xFFFFUL);
    lcsMode = (cy_en_syslib_lcs_mode_t)temp;
#elif defined(CY_IP_MXS22SRSS)
    lcsMode = (cy_en_syslib_lcs_mode_t)(base->DECODED_LCS_DATA);
#else
    lcsMode = (cy_en_syslib_lcs_mode_t)(CY_GET_REG32(base));
#endif

    switch (lcsMode)
    {
        case CY_SYSLIB_LCS_VIRGIN:
        case CY_SYSLIB_LCS_SORT:
        case CY_SYSLIB_LCS_PROVISIONED:
        case CY_SYSLIB_LCS_NORMAL_PROVISIONED:
        case CY_SYSLIB_LCS_NORMAL:
        case CY_SYSLIB_LCS_SECURE:
        case CY_SYSLIB_LCS_NORMAL_NO_SECURE:
        case CY_SYSLIB_LCS_RMA:
        break;
        default:
            lcsMode = CY_SYSLIB_LCS_CORRUPTED;
        break;
    }

    return lcsMode;
}
#endif /* defined(CY_IP_MXS22SRSS) || defined(CY_IP_MXS40SSRSS) */

#if (((defined (CY_CPU_CORTEX_M7) && CY_CPU_CORTEX_M7) || (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)) && (defined (__MPU_PRESENT) && (__MPU_PRESENT == 1U)))
bool Cy_Syslib_IsMemCacheable(MPU_Type* mpu, uint32_t addr, uint32_t size)
{
    uint32_t maxRegions;
    uint32_t en;
    uint8_t idx;
    uint32_t startAddr;
    bool ret = true;
#if (CY_CPU_CORTEX_M55)
    uint32_t endAddr;
    uint32_t attrIdx;
    uint32_t attribute;
    uint8_t reg;
    uint32_t pos;
    uint32_t mask;
#elif (CY_CPU_CORTEX_M7)
    uint32_t SIZE;
    uint32_t TEX;
    uint32_t C;
    uint32_t B;
#endif

    if ((NULL == mpu) || (size == (uint32_t)0))
    {
        return ret;
    }

    maxRegions = _FLD2VAL(MPU_TYPE_DREGION, mpu->TYPE);

    for (idx = 0; idx < maxRegions; idx++)
    {
        mpu->RNR = idx;
#if (CY_CPU_CORTEX_M55)
        en = _FLD2VAL(MPU_RLAR_EN, mpu->RLAR);
#elif (CY_CPU_CORTEX_M7)
        en = _FLD2VAL(MPU_RASR_ENABLE, mpu->RASR);
#endif

        if (en == 1U)
        {
#if (CY_CPU_CORTEX_M55)
            attrIdx = _FLD2VAL(MPU_RLAR_AttrIndx, mpu->RLAR);

            reg = (uint8_t)(attrIdx / 4U);
            pos = ((attrIdx % 4U) * 8U);
            mask = (uint32_t)((uint32_t)0x000000FFU << pos);

            if (reg >= (sizeof(mpu->MAIR) / sizeof(mpu->MAIR[0]))) {
                return ret; // invalid index
            }
            attribute = (uint8_t)((mpu->MAIR[reg] & mask) >> pos);
            startAddr = (uint32_t)(mpu->RBAR & MPU_RBAR_BASE_Msk);
            endAddr =  (uint32_t)(mpu->RLAR & MPU_RLAR_LIMIT_Msk);

            /*
                Check bit7:4 of outer attribute for non-cacheable region (0b0100 or 0x4)
                Check bit3:0 of inner attribute for non-cacheable region (0b0100 or 0x4)
                Thus the attribute is checked for 0x44
            */
            if ((attribute == (uint32_t)0x44) && (addr >= startAddr) && ((addr+size) <= endAddr))
            {
                ret = false;
                break;
            }
#elif (CY_CPU_CORTEX_M7)
            TEX = _FLD2VAL(MPU_RASR_TEX, mpu->RASR);
            C = _FLD2VAL(MPU_RASR_C, mpu->RASR);
            B = _FLD2VAL(MPU_RASR_B, mpu->RASR);
            startAddr = (uint32_t)(mpu->RBAR & MPU_RBAR_ADDR_Msk);
            SIZE = _FLD2VAL(MPU_RASR_SIZE, mpu->RASR);

            /*
                Check Type Extension field (TEX) bit21:19 for 0b001
                Check Cacheable bit17 for 0b0
                Check Bufferable bit16 for 0b0
            */
            if ((TEX == 1U) && (C == 0U) && (B == 0U) && (addr >= startAddr) && \
                ((addr+size) <= (startAddr + (1UL << (SIZE+1UL)))))
            {
                ret = false;
                break;
            }
#endif
        }
        else
        {
            // Nothing to be done
        }
    }
    return ret;
}
#endif // (((defined (CY_CPU_CORTEX_M7) && CY_CPU_CORTEX_M7) || (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)) && (defined (__MPU_PRESENT) && (__MPU_PRESENT == 1U)))

#if defined(CY_INIT_CODECOPY_ENABLE)
CY_SECTION_INIT_CODECOPY_END
#endif

#endif /* CY_IP_M33SYSCPUSS, CY_IP_M4CPUSS */

/* [] END OF FILE */
